targets/doris/test_plans/tpch-sf1-sequential.yaml
test_metadata:
  run_label: tpch-doris-sf1

test_environment:
  env_type: long-lived
  component_spec:
    type: k8s
    cluster_info:
      host: doris-doris-fe.crucible-benchmarks.svc.cluster.local
      port: 9030
      username: root
      password: ""
  target_db: tpch

execution:
  executor: k6
  scaling_mode: intra_node
  concurrency: 1
  ramp_up: "0s"
  hold_for: "300s"
  workload:
    - workload_id: tpch-sf1-doris